'''我们的首页'''
import streamlit as st

pag = st.sidebar.radio('我的首页',['我的兴趣推荐','我的图片处理工具','我的智慧词典','我的留言区'])

def page1():
    '''我的推荐'''
    st.write(':blue我的电影推荐')
    st.write('变形金刚全部','盗梦空间','这个杀手不太冷静')
    st.write('----------------------------------------------')
    st.write(':blue我的游戏推荐')
    st.write('王者荣耀','原神','史莱姆牧场')
    st.write('----------------------------------------------')
    st.write(':blue我的书籍推荐')
    st.write('三国演义','西游记','鲁宾逊漂流记')
    st.write('----------------------------------------------')
    st.write(':blue我的习题集推荐')
    st.write('英语语法习题集','中国文学史','数学分析解题指南')
    st.write('----------------------------------------------')
    
def page2():
    '''图片处理工具'''
    st.write('AI大画家','PS')
def page3():
    '''智慧词典'''
    st.write('风云翻译官','迅捷翻译')

def page4():
    '''留言区'''
    st.write('有没有跟我兴趣相投的人，快来和我交流吧。')


if page == '我的兴趣推荐':
    page1()
elif page == '我的图片处理工具':
    page2()
elif page == '我的智慧词典':
    page3()
elif page == '我的留言区':
    page4()
