'''我的主页'''
import streamlit as st

page = st.sidebar.radio('我的首页', ['我的兴许推荐', '我的图片处理工具','我的智慧词典','我的留言区'])

def page_1():
    '''我的推荐'''
    st.write('我的电影推荐')
    st.write('-----------------------------------------------------')
    st.write('我的游戏推荐')
    st.write('--------------------------------------------------------')
    st.write('我的书籍推荐')
    st.write('----------------------------------------------------------')
    st.write('我的习题推荐')
    st.write('----------------------------------------------------------')
if page == '我的兴趣推荐':
    page1()
elif page == '我的图片处理工具':
    page2()
elif page == '我的智慧词典':
    page3()
elif page == '我的留言区':
    page4
